# ===========================================
# Homebrew Bundle — consolidated laptop setup
# Single source of truth (managed via dotfiles)
# ===========================================

# ---------- Taps ----------
tap "hashicorp/tap"

# ---------- Core CLI & Utilities ----------
brew "oci-cli"             # Oracle Cloud Infrastructure CLI   
brew "bat"                 # colorful cat
brew "btop"                # modern system monitor
brew "direnv"              # per-dir env vars
brew "duf"                 # disk usage (df alternative)
brew "dust"                # disk usage (du alternative)
brew "eza"                 # modern ls
brew "fd"                  # user-friendly find
brew "fzf"                 # fuzzy finder
brew "gh"                  # GitHub CLI
brew "git"                 # Git
brew "gnu-sed"             # GNU sed
brew "httpie"              # HTTP client
brew "jq"                  # JSON processor
brew "lsd"                 # ls with icons
brew "ripgrep"             # fast grep
brew "starship"            # prompt
brew "stow"                # dotfiles symlinks
brew "tree"                # directory tree
brew "wget"                # file retriever
brew "yq"                  # YAML/JSON/XML/CSV processor
brew "zoxide"              # smarter cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ---------- Languages & Tooling ----------
brew "nvm"                 # Node version manager
brew "pipx"                # isolated Python CLIs
brew "pyenv"               # Python version manager
brew "pyenv-virtualenv"    # pyenv venv plugin

# ---------- Libraries & Build Deps ----------
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "tcl-tk"
brew "xz"
brew "zlib"

# ---------- Databases & Storage ----------
brew "duckdb"
brew "mysql"
brew "postgresql@16"
brew "redis"

# ---------- Kubernetes & Infrastructure ----------
brew "helm"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"      # provides kubectl
brew "hashicorp/tap/terraform"

# ---------- GUI Apps ----------
cask "caffeine"
cask "font-hack-nerd-font"
cask "iterm2"
cask "visual-studio-code"

# ---------- VS Code Extensions ----------
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "openai.chatgpt"
vscode "oracle.apm"
vscode "oracle.faas"
vscode "oracle.oci-core"
vscode "oracle.oci-vscode-toolkit"
vscode "oracle.odsc"
vscode "oracle.rms"
vscode "oracle.sql-developer"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "vscodevim.vim"
