
# ---------- Taps ----------
# (No taps needed; core/cask are auto-included and cask-fonts is deprecated)


# ---------- Core CLI ----------
brew "git"
brew "gh"            # GitHub CLI
brew "wget"
brew "jq"
brew "tree"
brew "htop"
brew "fzf"           # run: $(brew --prefix)/opt/fzf/install
brew "ripgrep"
brew "fd"
brew "starship"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "lsd"

brew "btop"
brew "dust"
brew "duf"
brew "httpie"
brew "yq"
brew "zoxide"
brew "eza"

# ---------- Python toolchain (pyenv-first) ----------
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "direnv"
# Build deps that make pyenv Pythons happy on macOS
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"
brew "tcl-tk"

# ---------- Node toolchain ----------
brew "nvm"

# ---------- Kubernetes & Docker ----------
brew "kubectl"
brew "helm"
brew "kubectx"       # includes kubens
brew "k9s"
# brew "kind"          # optional: works with Podman as backend if allowed

# ---------- GUI apps ----------
cask "iterm2"
cask "visual-studio-code"
cask "font-hack-nerd-font"

# ---------- Java (common build/runtime need) ----------
# If you build Java-backed tools or SDKs:
# cask "temurin"

# ----------- Database tools -----------
brew "postgresql"
brew "mysql"
brew "redis"
brew "duckdb"